Repository: brunocarvalhs/friends-secrets
Catalog: lib/app/core/localization/l10n/intl_*.arb
Languages: pt_br

# login_loginPage_headerDefault_title
source: Organize your secret friends in a place
pt_br: Organize seus amigos secretos em um lugar

# login_loginPage_headerDefault_subtitle
source: Create groups to make your friend secret with your friends
pt_br: Crie grupos para realizar seu amigo secreto com seus amigos

# login_loginPage_socialLoginButton_label
source: Login with Google
pt_br: Entrar com Google

# login_numberRegisterPage_headerDefault_title
source: Phone registration
pt_br: Registro de Telefone

# login_numberRegisterPage_headerDefault_subtitle
source: By registering your phone, the group organiser will be able to include you in the secret friend.
pt_br: Cadastrando seu telefone, o organizador do grupo, poderá te incluir no amigo secreto.

# login_numberRegisterPage_textFieldDefault_labelText
source: Cell phone
pt_br: Celular

# login_numberRegisterPage_floatingActionButton_label
source: Register
pt_br: Registrar

# login_numberValidationPage_headerDefault_title
source: Validating Phone
pt_br: Validando Telefone

# login_numberValidationPage_headerDefault_subtitle
source: A code has been sent to the registered phone to validate your number
pt_br: Um código foi enviado para o telefone registrado para validar seu número

# login_numberValidationPage_floatingActionButton_label
source: Register
pt_br: Registrar

# profile_likersPage_appBarDefault_title
source: Creation of likes
pt_br: Criação de gostos

# profile_likersPage_appBarDefault_subtitle
source: So that your secret friend knows your likes, we provide a list dof things he/she likes.
pt_br: Para que seu amigo secreto saiba seus gostos, nos disponibilizamos uma lista de coisas que gosta.

# profile_likersPage_floatingActionButton_label
source: Save
pt_br: Salvar

# notification_notificationPage_appBarDefault_title
source: Notification
pt_br: Notificação

# groups_groupsReadPage_text_labelMembers
source: Members
pt_br: Membros

# groups_groupsReadPage_text_addMembersTitle
source: Add new members
pt_br: Adicionar novos membros

# groups_groupsReadPage_text_showDrawnMembersLabel
source: See secret friend
pt_br: Ver amigo secreto

# groups_groupsReadPage_alertDialog_title
source: Conducting the draw
pt_br: Realização do sorteio

# groups_groupsReadPage_alertDialog_content
source: The draw is carried out only once per group, this process cannot be undone, do you want to continue the draw?
pt_br: O sorteio e realizado uma unica vez por grupo, esse processo não pode ser desfeito, deseja continuar o sorteio?

# groups_groupsReadPage_alertDialog_textButton_cancel
source: Cancel
pt_br: Cancelar

# groups_groupsReadPage_alertDialog_textButton_next
source: Next
pt_br: Continuar

# groups_groupsReadPage_floatingActionButton_label
source: Draw
pt_br: Sortear

# groups_groupsAddMembersPage_appBarDefault_title
source: Select members
pt_br: Selecione os membros

# groups_groupsAddMembersPage_appBarDefault_subtitle
source: Based on your contact list, list the users who are linked in the app, thus making it easier to select your secret buddy members.
pt_br: Com base na sua lista de contatos, listamos os usuários que tem vinculo no aplicativo, assim facilitando ao selecionar seus membros do amigo secreto.

# groups_groupsAddMembersPage_floatingActionButton_label
source: Add
pt_br: Adicionar

# groups_groupsListPage_floatingActionButton_label
source: Create group
pt_br: Criar Grupo

# groups_groupsRegisterMembersPage_appBarDefault_title
source: Select members
pt_br: Selecione os membros

# groups_groupsRegisterMembersPage_appBarDefault_subtitle
source: Based on your contact list, list the users who are linked in the app, thus making it easier to select your secret buddy members.
pt_br: Com base na sua lista de contatos, listamos os usuários que tem vinculo no aplicativo, assim facilitando ao selecionar seus membros do amigo secreto.

# groups_groupsRegisterMembersPage_floatingActionButton_label
source: Next
pt_br: Continuar

# groups_groupsRegisterInformationPage_appBarDefault_title
source: Set Information
pt_br: Definir Informações

# groups_groupsRegisterInformationPage_appBarDefault_subtitle
source: To finish creating the secret friend's group, we need to define some data about the group.
pt_br: Para finalizar a criação do grupo do amigo secreto, precisamos definir alguns dados sobre o grupo.

# groups_groupsRegisterInformationPage_textFieldDefault_name_labelText
source: Name
pt_br: Nome

# groups_groupsRegisterInformationPage_textFieldDefault_name_hintText
source: Ex.: Working Group
pt_br: Ex.: Grupo do Trabalho

# groups_groupsRegisterInformationPage_inputDecoration_date_hintText
source: Date
pt_br: Data

# groups_groupsRegisterInformationPage_inputDecoration_date_labelText
source: Date
pt_br: Data

# groups_groupsRegisterInformationPage_inputDecoration_hour_hintText
source: Hour
pt_br: Horário

# groups_groupsRegisterInformationPage_inputDecoration_hour_labelText
source: Hour
pt_br: Horário

# groups_groupsRegisterInformationPage_textFieldDefault_priceMin_labelText
source: Best price
pt_br: Preço Minímo

# groups_groupsRegisterInformationPage_textFieldDefault_priceMax_labelText
source: Ceiling price
pt_br: Preço Máximo

# groups_groupsRegisterInformationPage_textFieldDefault_description_labelText
source: Description
pt_br: Descrição

# groups_groupsRegisterTypePage_appBarDefault_title
source: Select the category
pt_br: Selecione a categoria

# groups_groupsRegisterTypePage_appBarDefault_subtitle
source: We define types of secret friends that our platform makes available for our users to have fun in different ways.
pt_br: Definimos tipos de amigos secretos que nossa plataforma disponibiliza para nossos usuários poderem se divertir de diversas maneiras diferentes.

# groups_groupsRegisterTypePage_floatingActionButton_label
source: Next
pt_br: Continuar
